Repository: DoniDevRs/PassGen
Catalog: PassGen/PassGen/*.lproj/Localizable.strings
Languages: pt_br

# titlePasswordGeneratorVC
source: Password Generator
pt_br: Gerador de Senhas

# numberOfPasswordsText
source: Number of Passwords:
pt_br: Quantidade de Senhas:

# totalCharactersText
source: Total Characters:
pt_br: Total de Caracteres:

# useLowerCaseText
source: Use Lowercase Letters:
pt_br: Usar letras minúsculas:

# useNumbersText
source: Use Numbers:
pt_br: Usar números:

# useCapitalLettersText
source: Use Capital Letters:
pt_br: Usar letras maiúsculas:

# useSpecialCharText
source: Use Special Characters:
pt_br: Usar caracteres especiais:

# buttonGenerateTitle
source: Generate Password
pt_br: Gerar Senha

# titlePasswordsListVC
source: Passwords List
pt_br: Lista de Senhas

# buttonGenerateAgainTitle
source: Generate Again
pt_br: Gerar novamente

# buttonTipsSecTitle
source: Secutiry Tips
pt_br: Dicas de Segurança

# closeButton
source: Close
pt_br: Fechar

# labelTitle
source: 10 Tips to create a Strong Password
pt_br: 10 dicas para criar uma senha forte.

# tip1Title
source: 1. Choose passwords easy to remember:
pt_br: 1. Escolha senhas fáceis de lembrar:

# tip1Description
source: A password that is easy to remember prevents the user from having to write it down on paper or files, which could end up in the hands of the wrong people.
pt_br: Uma senha fácil de guardar na memória evita que o usuário tenha que anotá-la em papeis ou arquivos, que podem chegar às mãos de pessoas erradas.

# tip2Title
source: 2. Don't use real words:
pt_br: 2. Não use palavras reais:

# tip2Description
source: A word that can be found in the dictionary can make the work of hackers easier. To make this job more difficult, use phrases instead of nouns.
pt_br: Uma palavra que pode ser encontrada no dicionário pode facilitar o trabalho de hackers. Para tornar esse trabalho mais difícil, use frases ao invés de substantivos.

# tip3Title
source: 3. Combine uppercase, lowercase, numbers, and non-alphanumeric characters:
pt_br: 3. Combine maiúsculas, minúsculas, números e caracteres não alfanuméricos:

# tip3Description
source: Inserting these items into the password further complicates the work of anyone with malicious intent.
pt_br: A inserção desses itens na senha complica ainda mais o trabalho de quem estiver mal intencionado.

# tip4Title
source: 4. Don't recycle passwords:
pt_br: 4. Não recicle senhas:

# tip4Description
source: For example, don't use 'password1', 'password2', 'password3' on different accounts. By changing just one character, the user runs the risk of handing over access to other services to the cybercriminal.
pt_br: Por exemplo, não use 'senha1', 'senha2', 'senha3' em contas diferentes. Ao mudar apenas um caractere, o usuário corre o risco de entregar o acesso a outros serviços ao cibercriminoso.

# tip5Title
source: 5. Don't use the same password for multiple accounts:
pt_br: 5. Não use a mesma senha para várias contas:

# tip5Description
source: The same applies in this case. If the worst happens, the user loses the security of all their accounts.
pt_br: O mesmo se aplica nesse caso. Caso o pior aconteça, o usuário perde a segurança de todas as suas contas.

# tip6Title
source: 6. Don't use obvious passwords that can be easily guessed:
pt_br: 6. Não use senhas óbvias que podem ser facilmente descobertas:

# tip6Description
source: Do not choose the name of family members as your code, such as your son, husband or even your pet. By lightly investigating someone's life, these names are easily discovered and can become a weapon.
pt_br: Não escolha como código o nome de pessoas da família, como filho, marido ou até do animal de estimação. Ao investigar levemente a vida de alguém, esses nomes são facilmente descobertos e podem se tornar uma arma.

# tip7Title
source: 7. Don't share your password:
pt_br: 7. Não compartilhe sua senha:

# tip7Description
source: Never share your personal information. If a company asks for your password, even over the phone, don't tell them. Remember, you don't know who is on the other end of the phone line.
pt_br: Nunca compartilhe suas informações pessoais. Se alguma empresa pedir sua senha, mesmo que por telefone, não informe. Lembre-se, você não sabe quem está do outro lado da linha telefônica.

# tip8Title
source: 8. If a website sends you a confirmation email with a new password, log in to the page and change your password immediately :
pt_br: 8. Se algum site enviar um e-mail de confirmação com uma nova senha, inicie uma nova sessão na página e altere sua senha imediatamente:

# tip8Description
source: This procedure prevents possible fraud. When opening suspicious links, the user may end up providing personal information without realizing it.
pt_br: Esse procedimento evita possíveis fraudes. Ao abrir links suspeitos, o usuário pode acabar fornecendo informações pessoais sem perceber.

# tip9Title
source: 9. Make sure your internet security software blocks cybercriminals' intentions to intercept or steal passwords:
pt_br: 9. Certifique-se de que seu software de segurança da Internet bloqueie as intenções dos cibercriminosos de interceptar ou roubar senhas:

# tip9Description
source: Many attacks can be prevented by activating basic antivirus internet protection services.
pt_br: Muitos ataques podem ser evitados ao ativar serviços básicos de proteção na internet dos antivírus.

# tip10Title
source: 10. If you find it difficult to remember multiple complex passwords, consider installing a password manager :
pt_br: 10. Se você achar que é difícil lembrar-se de várias senhas complexas, considere a instalação de um gerenciadores de senhas:

# tip10Description
source: There are several programs available that store data securely and help the most forgetful.
pt_br: Há diversos programas disponíveis que armazenam os dados de maneira segura e ajudam os mais esquecidos.
